# 반복문 = 기준에 따른 반복
#     1. for 변수명 in 리스트명 :                         리스트내 모든 변수를 하니씩 변수명에 대입
#     2. for 변수명 int range( 시작값 , 끝값 , 중감단위 ) : 시작값 부터 끝값까지 중감하면서 변수명에 하니씩 대입
         # range( 값 ) : 값 만큼 반복 실행
         # range( 시작값 , 끝값 ) : 시작값 부터 끝값전까지 1씩 증가하면서 반복
         # range( 시작값 , 끝값 , 중감단위 ) : 시작값부터 끝값까지 증감하면서 변수명에 하나씩 대입

# 2~9단 구구단 : for문 중첩 예제
for 단 in range(2,10) : # 2 부터 9까지 1씩 증가 하면서 단에 하니씩 대입
    for 곱 in range( 1 , 10 ) : # 1부터 9까지 1씩 증가 하면서 곱에 하나씩 대입
        print( 단 , " x " , 곱 , "=", (단*곱) )
# 단은 8번 반복 : 곱은 단이 1씩 증가할때마다 9번씩 반복 = 72번 반복

    # * 피라미드 만들기
for 변수 in range( 1 , 6 ) :
    print( " "*(6-변수) , "*"*(2*변수-1) )

# 알고리즘 = 순서도 = 코드 명령 순서
    #     *         1줄      =   공백 4개    별1개
    #    ***        2줄      =   공백 3개    별3개
    #   *****       3줄      =   공백 2개    별5개
    #  *******      4줄      =   공백 1개    별7개
    # *********     5줄      =   공백 0개    별9개
    #              1씩 증가        1씩 감소    2개씩증가
    #                            최대줄수 - 현재줄수     현재줄수*2 -1
    #              range( 1 , 6 )      " "*(6-변수)     "*"*(2*변수-1)



# 131
과일 = ["사과" , "귤" , "수박"]
for 변수 in 과일 : # 과일의 리스트 개수만큼 하나씩 반복
    print(변수)
    # 사과 , 귤 , 수박 출력된다

# 132
과일 = ["사과" , "귤" , "수박"]
for 변수 in 과일 : # 과일의 리스트 개수만큼 하나씩 반복
    print("#####")
    # ##### 3번 출력된다

# 133
변수 = "A"
print(변수)
변수 = "B"
print(변수)
변수 = "C"
print(변수)

# 134
변수 = "A"
print("출력 : " , 변수)
변수 = "B"
print("출력 : " , 변수)
변수 = "C"
print("출력 : " , 변수)

# 135
변수 = "A"
print("출력 : " , 변수.lower() )
변수 = "B"
print("출력 : " , 변수.lower() )
변수 = "C"
print("출력 : " , 변수.lower() )

# 136
for 변수 in [10,20,30] :
    print(변수)

# 137
for 변수 in [10,20,30] :
    print(변수)

# 138
for 변수 in [10,20,30] :
    print(변수)
    print("-------")


# 139
print("++++")
for 변수 in [10,20,30] :
    print(변수)

# 140
for 변수 in [ 1 ,2 , 3 , 4 ] :
    print("--------") # 리스트내 개수만큼 반복 = 총4번 출력

# 141
리스트 = [ 100 , 200 , 300 ]
for 변수 in 리스트 : # 리스트내 개수만큼 변수에 하나씩 대입
    print(변수+10)

# 142
리스트 = ["김밥" , "라면" , "튀김" ]
for 변수 in 리스트 :
    print(" 오늘의 메뉴 : " , "변수" )

# 143
리스트 = ["sk하이니스" , "삼성전자" , "LG전자" ]
for 변수 in 리스트 :
    print( len(변수) ) # 문자열 길이가 출력

#문제 144
리스트 = ["dog" , "cat" , "parrot" ]
for 변수 in 리스트 :
    print( 변수 , len(변수) )

# 145
리스트 = ["dog" , "cat" , "parrot" ]
for 변수 in 리스트 :
    print( 변수[0] ) # 0번째 인덱싱 = 첫글자

# 146
리스트 = [ 1 , 2 , 3 ]
for 변수 in 리스트 :
    print("3 x " , 변수 )
        # 일반문자는 " " 사용함   # 변수는 " " 사용X

# 147
리스트 = [ 1 , 2 , 3 ]
for 변수 in 리스트 :
    print( "3 x " , 변수 , "=" , (3*변수) )
        #  "문자" , 변수 , "문자" , (숫자*변수)

# 148
리스트 = [ "가" , "나" , "다" , "라" ]
for 변수 in 리스트[ 1 : ] :
    print(변수)

# 149
리스트 = [ "가" , "나" , "다" , "라" ]
for 변수 in 리스트[ 0 : 3 : 2 ] : # 9번부터 3번까지 2씩 증가
    print(변수)

# 150
리스트 = [ "가" , "나" , "다" , "라" ]
for 변수 in 리스트[ : : -1 ] : # 0번부터 끝까지 -1 역순으로 증가
    print(변수)

# 151
리스트 = [ 3 , -20 , -3 , 44 ]
for 변수 in 리스트 :
    if 변수 > 0 : # 만약에 변수가 0보다 작으면
        print(변수) # 출력


# 152
리스트 = [ 3 , 100 , 23 ,44 ]
for 변수 in 리스트 :
    if 변수 % 3 == 0 : # 만약에 변수가 % 3 했을때 나머지가 0이면
        print(변수) # 출력

# 153
리스트 = [ 13 , 21 , 12 , 14 , 30 , 18 ]
for 변수 in 리스트 :
    if 변수 < 20 and 변수 % 3 == 0 :
        print(변수)

# 154
리스트 = ["I" , "study" , "python" , "language" , "!"]
for 변수 in 리스트 :
    if len(변수) >= 3 : # 만약에 글자수가 3글자 이상이라면
        print( 변수 )

# 155
리스트 = [ "A" , "b" , "c" , "D" ]
for 변수 in 리스트 :
    if 변수.upper() : # 만약에 변수가 대문자이면
        print( 변수 )

# 156
리스트 = ["A" , "b" , "c" , "D" ]
for 변수 in 리스트 :
    if 변수.lower() : # 만약 변수가 소문자이면
        print( 변수 )

# 157
리스트 = ['dog' , 'cat' , 'parrot' ]
for 변수 in 리스트 :
    첫글자 = 변수[0]
    대문자 = 첫글자.upper()
    print( 대문자 + 변수[1:])

# 158
리스트 = [ 'hello.py' , 'ex01.py' , 'intro.hwp' ]
for 변수 in 리스트 :
    split = 변수.split(".")
    print(split[0])

# 159
리스트 = [ 'intra.h' , 'intra.c' , 'define.h' , 'run.py' ]
for 변수 in 리스트 :
    split = 변수.split(".")
    if split[1] == "h" :
        print(split)

# 160
리스트 = [ 'intra.h' , 'intra.c' , 'define.h' , 'run.py' ]
for 변수 in 리스트 :
    split = 변수.split(".")
    if split[1] == "h" or split[1] == "c" :
        print(split)

# 161
for i in range (100) :
    print(i)

# 162
for i in range ( 2002 , 2050 , 4 ) :
    print(i)

#  163
for i in range( 3 , 31 , 3) :
    print(i)


# 164
for i in range (100) :
    print( 99 - i )

# 165
for i in range (10) :
    print( i / 10  )

# 166
for i in range (1 , 10) :
    print( 3 , " x " , i , "=", (3*i) )

# 167
for 곱 in range( 1 ,10 ) :
    if 곱 % 2 == 1 :
        print(3 , "x" , 곱, "=" , 3*곱)
# 168
합계 = 0
for 변수 in range( 1 , 11 ) :
    합계 += 변수 # 합계변수에 변수를 더한 후에 합꼐변수에 대입

print( "누적합계 : " , 합계 )

# 169
합계 = 0
for 변수 in range( 1 , 11 ) :
    if 변수 % 2 == 1 : # 홀수 구하기
      합계 += 변수 # 합계변수에 변수를 더한 후에 합꼐변수에 대입

print( "홀수 누적합계 : " , 합계 )

# 170
누적곱 = 1 # 곱하기를 하기 때문에 0으로 시작할수 없음
for 변수 in range( 1 , 11 ):
    누적곱 *= 변수 # 합계변수에 변수를 곱한 후에 누적곱 변수에 대입




